open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_session.c
/* SPDX-License-Identifier: Apache-2.0 */

/* Reuse the byte-stream and audio fakes from the gateway component suite,
 * while still running that suite in this executable.  This keeps the session
 * test focused on orchestration instead of maintaining a second transport
 * implementation.
 */

#define main bkvoice_gateway_component_tests
#include "test_bk7258_voice_gateway.c"
#undef main

#include "bk7258_voice_session.h"

#include <semaphore.h>

struct session_source_s
{
  sem_t audio_sent;
  sem_t wake_reader;
  bool attached;
  int reads;
  int interrupts;
  int detaches;
};

struct session_fixture_s
{
  struct fake_transport_s transport;
  struct fake_audio_s audio;
  struct fake_clock_s clock;
  struct session_source_s source;
  struct bkvoice_ptt_s ptt;
  struct bkvoice_session_s session;
  uint32_t session_id;
  uint32_t server_sequence;
  unsigned int ota_calls;
  uint32_t ota_request_sequence;
};

struct session_prefill_s
{
  struct session_source_s *source;
  unsigned int read_calls;
  unsigned int live_calls;
  uint8_t live_marker;
};

static int session_source_attach(void *context)
{
  struct session_source_s *source = context;

  assert(!source->attached);
  source->attached = true;
  return 0;
}

static ssize_t session_source_read(void *context, void *pcm, size_t bytes)
{
  struct session_source_s *source = context;
  int ret;

  assert(source->attached && pcm != NULL);
  source->reads++;
  if (source->reads == 1 || source->reads == 3)
    {
      assert(bytes == BKVOICE_CAPTURE_FRAME_BYTES);
      memset(pcm, source->reads == 1 ? 0x51 : 0x52, bytes);
      assert(sem_post(&source->audio_sent) == 0);
      return (ssize_t)bytes;
    }

  do
    {
      ret = sem_wait(&source->wake_reader);
    }
  while (ret < 0 && errno == EINTR);

  assert(ret == 0);
  return -EPIPE;
}

static int session_source_interrupt(void *context)
{
  struct session_source_s *source = context;

  assert(source->attached);
  source->interrupts++;
  return sem_post(&source->wake_reader) == 0 ? 0 : -errno;
}

static int session_source_detach(void *context)
{
  struct session_source_s *source = context;

  assert(source->attached);
  source->attached = false;
  source->detaches++;
  return 0;
}

static const struct bkvoice_capture_source_ops_s g_session_source_ops =
{
  .attach = session_source_attach,
  .read = session_source_read,
  .interrupt = session_source_interrupt,
  .detach = session_source_detach,
};

static int session_prefill_read(
  void *context, size_t frame_index,
  uint8_t pcm[BKVOICE_CAPTURE_FRAME_BYTES])
{
  struct session_prefill_s *prefill = context;

  assert(prefill != NULL && prefill->source != NULL && pcm != NULL);
  assert(prefill->source->attached && prefill->source->reads == 0);
  assert(frame_index == prefill->read_calls);
  prefill->read_calls++;
  memset(pcm, (int)(0xa0u + frame_index),
         BKVOICE_CAPTURE_FRAME_BYTES);
  return 0;
}

static void session_live_observe(
  void *context, const struct bkvoice_turn_token_s *token,
  const uint8_t pcm[BKVOICE_CAPTURE_FRAME_BYTES])
{
  struct session_prefill_s *prefill = context;

  assert(prefill != NULL && prefill->source != NULL && token != NULL &&
         pcm != NULL);
  assert(token->boot_generation == 7 && token->session_id == 1 &&
         token->turn_id != 0);
  prefill->live_calls++;
  prefill->live_marker = pcm[0];
}

static void session_enqueue_server(
  struct session_fixture_s *fixture, uint8_t type, uint16_t flags,
  uint32_t turn_id, const uint8_t *payload, uint32_t payload_len)
{
  struct bkvoice_companion_header_s header;
  uint8_t frame[BKVOICE_GATEWAY_FRAME_BYTES];
  size_t frame_size;

  memset(&header, 0, sizeof(header));
  header.magic = BKVOICE_COMPANION_MAGIC;
  header.version = BKVOICE_COMPANION_VERSION;
  header.type = type;
  header.flags = flags;
  header.header_len = BKVOICE_COMPANION_HEADER_BYTES;
  header.payload_len = payload_len;
  header.boot_generation = 7;
  header.session_id = fixture->session_id;
  header.turn_id = turn_id;
  header.sequence = ++fixture->server_sequence;
  header.timestamp_ms = fixture->clock.now_ms;
  assert(bkvoice_companion_encode(&header, payload, frame, sizeof(frame),
                                  &frame_size) == 0);
  assert(fixture->transport.rx_size + frame_size <=
         sizeof(fixture->transport.rx));
  memcpy(fixture->transport.rx + fixture->transport.rx_size, frame,
         frame_size);
  fixture->transport.rx_size += frame_size;
}

static void session_wait_audio(struct session_fixture_s *fixture)
{
  int ret;

  do
    {
      ret = sem_wait(&fixture->source.audio_sent);
    }
  while (ret < 0 && errno == EINTR);

  assert(ret == 0);
}

static uint8_t session_tx_payload_marker(
  const struct fake_transport_s *transport, size_t index)
{
  struct bkvoice_companion_header_s header;
  const uint8_t *payload;
  size_t offset = 0;
  size_t frame_size;

  for (size_t current = 0; current <= index; current++)
    {
      assert(offset + BKVOICE_COMPANION_HEADER_BYTES <= transport->tx_size);
      frame_size = BKVOICE_COMPANION_HEADER_BYTES +
                   test_get_be32(transport->tx + offset + 12);
      assert(offset + frame_size <= transport->tx_size);
      if (current == index)
        {
          assert(bkvoice_companion_decode(transport->tx + offset,
                                          frame_size, &header,
                                          &payload) == 0);
          assert(header.type == BKVOICE_COMPANION_AUDIO_UP);
          assert(header.payload_len == BKVOICE_CAPTURE_FRAME_BYTES);
          return payload[0];
        }

      offset += frame_size;
    }

  assert(false);
  return 0;
}

static int session_ota_request(
  void *context, uint32_t request_sequence,
  const uint8_t digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES])
{
  struct session_fixture_s *fixture = context;

  assert(digest != NULL);
  fixture->ota_calls++;
  fixture->ota_request_sequence = request_sequence;
  return 0;
}

static void session_fixture_initialize_options(struct session_fixture_s *fixture,
                                               bool ota)
{
  const struct bkvoice_ptt_worker_config_s worker_config =
  {
    .stack_size = 0,
    .priority = 0,
    .join_timeout_ms = 1000,
  };
  const struct bkvoice_turn_limits_s turn_limits =
  {
    .capture_timeout_ms = 1000,
    .waiting_tts_timeout_ms = 1000,
    .playback_timeout_ms = 1000,
    .audio_frame_bytes = BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
  };
  struct bkvoice_session_config_s session_config =
  {
    .gateway =
    {
      .io_timeout_ms = 50,
    },
    .initial_downlink_credit = BKVOICE_COMPANION_AUDIO_FRAME_BYTES,
  };
  struct bkvoice_session_snapshot_s snapshot;

  memset(fixture, 0, sizeof(*fixture));
  if (ota)
    {
      session_config.gateway.ota_request = session_ota_request;
      session_config.gateway.ota_context = fixture;
    }
  fake_transport_initialize(&fixture->transport);
  fixture->clock.now_ms = 100;
  assert(sem_init(&fixture->source.audio_sent, 0, 0) == 0);
  assert(sem_init(&fixture->source.wake_reader, 0, 0) == 0);
  assert(bkvoice_ptt_initialize(
           &fixture->ptt, &g_audio_ops, &fixture->audio,
           &g_session_source_ops, &fixture->source, &turn_limits,
           &worker_config, 7) == 0);
  assert(bkvoice_session_initialize(
           &fixture->session, &fixture->ptt, &g_transport_ops,
           &fixture->transport, fake_now_ms, &fixture->clock,
           &session_config, 7) == 0);
  assert(bkvoice_session_connect(&fixture->session, 500) == 0);
  bkvoice_session_snapshot(&fixture->session, &snapshot);
  fixture->session_id = snapshot.gateway.session_id;
  assert(fixture->session_id == 1);
  assert(snapshot.connected && !snapshot.ready);

  session_enqueue_server(fixture, BKVOICE_COMPANION_WELCOME, 0, 0,
                         NULL, 0);
  struct bkvoice_gateway_frame_s welcome;
  assert(bkvoice_gateway_receive_frame(&fixture->session.gateway,
                                        &welcome, 600) == 0);
  bkvoice_session_snapshot(&fixture->session, &snapshot);
  assert(snapshot.connected && !snapshot.ready);
  assert(!snapshot.ptt.session_open && !fixture->source.attached);
  assert(bkvoice_session_dispatch_frame(&fixture->session, &welcome) == 0);
  bkvoice_session_snapshot(&fixture->session, &snapshot);
  assert(snapshot.ready && snapshot.ptt.session_open);
}

static void session_fixture_initialize(struct session_fixture_s *fixture)
{
  session_fixture_initialize_options(fixture, false);
}

