open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_session.c
static void session_start_capture(struct session_fixture_s *fixture,
                                  struct bkvoice_turn_token_s *token)
{
  uint8_t window[sizeof(uint32_t)];

  test_put_be32(window, BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  session_enqueue_server(fixture, BKVOICE_COMPANION_WINDOW_UPDATE, 0, 0,
                         window, sizeof(window));
  assert(bkvoice_session_receive_one(&fixture->session, 601) == 0);
  assert(bkvoice_session_ptt_down(&fixture->session,
                                  fixture->clock.now_ms, token) == 0);
  session_wait_audio(fixture);
  assert(bkvoice_session_ptt_up(&fixture->session,
                                fixture->clock.now_ms + 20) == 0);
}

static bool session_playback_done;

static void test_session_prefill_order(void)
{
  static const uint8_t expected_types[] =
  {
    BKVOICE_COMPANION_HELLO,
    BKVOICE_COMPANION_WINDOW_UPDATE,
    BKVOICE_COMPANION_TURN_START,
    BKVOICE_COMPANION_AUDIO_UP,
    BKVOICE_COMPANION_AUDIO_UP,
    BKVOICE_COMPANION_AUDIO_UP,
    BKVOICE_COMPANION_TURN_END,
  };
  struct bkvoice_session_snapshot_s snapshot;
  struct bkvoice_turn_token_s token;
  struct session_prefill_s prefill;
  struct session_fixture_s fixture;
  uint8_t window[sizeof(uint32_t)];

  session_fixture_initialize(&fixture);
  memset(&prefill, 0, sizeof(prefill));
  prefill.source = &fixture.source;
  test_put_be32(window, 3u * BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  session_enqueue_server(&fixture, BKVOICE_COMPANION_WINDOW_UPDATE, 0, 0,
                         window, sizeof(window));
  assert(bkvoice_session_receive_one(&fixture.session, 601) == 0);
  assert(bkvoice_session_ptt_down_prefill(
           &fixture.session, fixture.clock.now_ms, session_prefill_read,
           &prefill, 2, session_live_observe, &prefill, &token) == 0);
  session_wait_audio(&fixture);
  assert(bkvoice_session_ptt_up(&fixture.session,
                                fixture.clock.now_ms + 20) == 0);
  assert(fixture.transport.tx_size > 0);
  assert(fixture.session.gateway.tx_frames == sizeof(expected_types));
  for (size_t index = 0; index < sizeof(expected_types); index++)
    {
      assert(fake_tx_header(&fixture.transport, index).type ==
             expected_types[index]);
    }

  assert(session_tx_payload_marker(&fixture.transport, 3) == 0xa0);
  assert(session_tx_payload_marker(&fixture.transport, 4) == 0xa1);
  assert(session_tx_payload_marker(&fixture.transport, 5) == 0x51);
  assert(prefill.live_calls == 1 && prefill.live_marker == 0x51);
  bkvoice_session_snapshot(&fixture.session, &snapshot);
  assert(snapshot.ptt.capture.frames_sent == 3);
  assert(snapshot.ptt.capture.prefill_frames_sent == 2);
  assert(snapshot.ptt.turn.state == BKVOICE_TURN_WAITING_TTS);

  assert(bkvoice_session_interrupt(&fixture.session) == 0);
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_uninitialize(&fixture.session) == 0);
  assert(bkvoice_ptt_uninitialize(&fixture.ptt) == 0);
  assert(sem_destroy(&fixture.source.audio_sent) == 0);
  assert(sem_destroy(&fixture.source.wake_reader) == 0);
}

static int session_async_drain(void *context)
{
  (void)context;
  return -EINPROGRESS;
}

static int session_async_result(void *context)
{
  (void)context;
  return session_playback_done ? 0 : -EAGAIN;
}

static void test_session_single_turn_and_remote_cancel(void)
{
  struct bkvoice_session_snapshot_s snapshot;
  struct bkvoice_turn_token_s first;
  struct bkvoice_turn_token_s second;
  struct bkvoice_companion_header_s header;
  struct session_fixture_s fixture;
  uint8_t audio[BKVOICE_COMPANION_AUDIO_FRAME_BYTES];
  size_t index;
  static const uint8_t expected_types[] =
  {
    BKVOICE_COMPANION_HELLO,
    BKVOICE_COMPANION_WINDOW_UPDATE,
    BKVOICE_COMPANION_TURN_START,
    BKVOICE_COMPANION_AUDIO_UP,
    BKVOICE_COMPANION_TURN_END,
  };

  memset(audio, 0x61, sizeof(audio));
  session_fixture_initialize(&fixture);
  fixture.ptt.turn.ops.dac_drain = session_async_drain;
  fixture.ptt.turn.ops.dac_result = session_async_result;
  session_playback_done = false;
  session_start_capture(&fixture, &first);
  assert(fixture.audio.mic_release_calls == 1);

  session_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_START,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC,
                         first.turn_id, NULL, 0);
  assert(bkvoice_session_receive_one(&fixture.session, 700) == 0);
  for (index = 0; index < 6; index++)
    {
      session_enqueue_server(&fixture, BKVOICE_COMPANION_AUDIO_DOWN,
                             BKVOICE_COMPANION_FLAG_SYNTHETIC,
                             first.turn_id, audio, sizeof(audio));
      assert(bkvoice_session_receive_one(&fixture.session,
                                         701 + index) == 0);
      assert(fake_tx_window_credit(&fixture.transport, 5 + index) ==
             sizeof(audio));
    }

  session_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_END,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC,
                         first.turn_id, NULL, 0);
  assert(bkvoice_session_receive_one(&fixture.session, 707) == 0);
  size_t before_complete = fixture.transport.tx_size;
  assert(bkvoice_session_poll(&fixture.session) == 0);
  assert(fixture.transport.tx_size == before_complete);
  assert(fixture.ptt.turn.state == BKVOICE_TURN_DRAINING);
  session_playback_done = true;
  assert(bkvoice_session_poll(&fixture.session) == 0);
  header = fake_tx_header(&fixture.transport,
                          fixture.session.gateway.tx_frames - 1);
  assert(header.type == BKVOICE_COMPANION_ACK &&
         header.turn_id == first.turn_id);
  before_complete = fixture.transport.tx_size;
  assert(bkvoice_session_poll(&fixture.session) == 0);
  assert(fixture.transport.tx_size == before_complete);
  bkvoice_session_snapshot(&fixture.session, &snapshot);
  assert(snapshot.ready && snapshot.ptt.turn.state == BKVOICE_TURN_IDLE);
  assert(fixture.audio.dac_write_calls == 6);
  assert(fixture.audio.dac_bytes == sizeof(audio) * 6u);
  assert(fixture.audio.dac_release_calls == 1);

  /* A late remote cancel after normal completion must not disconnect or
   * release the already closed audio path twice.
   */

  session_enqueue_server(&fixture, BKVOICE_COMPANION_CANCEL, 0,
                         first.turn_id, NULL, 0);
  assert(bkvoice_session_receive_one(&fixture.session, 708) == 0);
  bkvoice_session_snapshot(&fixture.session, &snapshot);
  assert(snapshot.ready && !snapshot.terminal_pending);
  assert(snapshot.ptt.turn.state == BKVOICE_TURN_IDLE);
  assert(fixture.audio.dac_release_calls == 1);

