open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_session.c
  for (index = 0; index < sizeof(expected_types); index++)
    {
      header = fake_tx_header(&fixture.transport, index);
      assert(header.type == expected_types[index]);
    }

  header = fake_tx_header(&fixture.transport,
                          fixture.session.gateway.tx_frames - 1);
  assert(header.type == BKVOICE_COMPANION_ACK);
  assert(header.session_id == first.session_id &&
         header.turn_id == first.turn_id);

  session_start_capture(&fixture, &second);
  session_enqueue_server(&fixture, BKVOICE_COMPANION_CANCEL, 0,
                         second.turn_id, NULL, 0);
  struct bkvoice_gateway_frame_s cancel;
  assert(bkvoice_gateway_receive_frame(&fixture.session.gateway,
                                        &cancel, 800) == 0);
  bkvoice_session_snapshot(&fixture.session, &snapshot);
  assert(!snapshot.terminal_pending && snapshot.ready);
  assert(snapshot.ptt.turn.state == BKVOICE_TURN_WAITING_TTS);
  size_t before_cancel_tx = fixture.transport.tx_size;
  assert(bkvoice_session_dispatch_frame(&fixture.session, &cancel) == 0);
  bkvoice_session_snapshot(&fixture.session, &snapshot);
  assert(snapshot.ready && !snapshot.terminal_pending);
  assert(snapshot.ptt.turn.state == BKVOICE_TURN_IDLE);
  assert(fixture.source.interrupts == 2);
  assert(fixture.source.detaches == 2);
  assert(!fixture.source.attached && !snapshot.ptt.worker_joinable);
  assert(fixture.transport.tx_size > before_cancel_tx);
  header = fake_tx_header(&fixture.transport,
                          fixture.session.gateway.tx_frames - 1);
  assert(header.type == BKVOICE_COMPANION_ACK);
  assert(header.session_id == second.session_id &&
         header.turn_id == second.turn_id);

  assert(bkvoice_session_interrupt(&fixture.session) == 0);
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_uninitialize(&fixture.session) == 0);
  assert(bkvoice_ptt_uninitialize(&fixture.ptt) == 0);
  assert(sem_destroy(&fixture.source.audio_sent) == 0);
  assert(sem_destroy(&fixture.source.wake_reader) == 0);
}

static int session_fail_dac_stop(void *context)
{
  (void)context;
  return -EIO;
}

static void test_cancel_cleanup_failure_has_no_ack(void)
{
  struct session_fixture_s fixture;
  struct bkvoice_turn_token_s token;
  size_t before;

  session_fixture_initialize(&fixture);
  session_start_capture(&fixture, &token);
  session_enqueue_server(&fixture, BKVOICE_COMPANION_TTS_START,
                         BKVOICE_COMPANION_FLAG_SYNTHETIC,
                         token.turn_id, NULL, 0);
  assert(bkvoice_session_receive_one(&fixture.session, 700) == 0);
  fixture.ptt.turn.ops.dac_stop = session_fail_dac_stop;
  before = fixture.transport.tx_size;
  session_enqueue_server(&fixture, BKVOICE_COMPANION_CANCEL, 0,
                         token.turn_id, NULL, 0);
  assert(bkvoice_session_receive_one(&fixture.session, 701) == -EIO);
  assert(fixture.transport.tx_size == before);
  fixture.ptt.turn.ops.dac_stop = fake_dac_stop;
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_uninitialize(&fixture.session) == 0);
  assert(bkvoice_ptt_uninitialize(&fixture.ptt) == 0);
  assert(sem_destroy(&fixture.source.audio_sent) == 0);
  assert(sem_destroy(&fixture.source.wake_reader) == 0);
}

static void test_remote_cancel_before_local_release_is_idempotent(void)
{
  struct bkvoice_session_snapshot_s snapshot;
  struct bkvoice_turn_token_s first;
  struct bkvoice_turn_token_s second;
  struct session_fixture_s fixture;
  uint8_t window[sizeof(uint32_t)];

  session_fixture_initialize(&fixture);
  test_put_be32(window, BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  session_enqueue_server(&fixture, BKVOICE_COMPANION_WINDOW_UPDATE, 0, 0,
                         window, sizeof(window));
  assert(bkvoice_session_receive_one(&fixture.session, 601) == 0);
  assert(bkvoice_session_ptt_down(&fixture.session,
                                  fixture.clock.now_ms, &first) == 0);
  session_wait_audio(&fixture);

  session_enqueue_server(&fixture, BKVOICE_COMPANION_CANCEL, 0,
                         first.turn_id, NULL, 0);
  assert(bkvoice_session_receive_one(&fixture.session, 700) == 0);
  bkvoice_session_snapshot(&fixture.session, &snapshot);
  assert(snapshot.connected && snapshot.ready &&
         snapshot.ptt.turn.state == BKVOICE_TURN_IDLE);
  assert(!snapshot.ptt.worker_joinable && !fixture.source.attached);

  /* The local release can cross the already-completed remote cancellation. */

  assert(bkvoice_session_ptt_up(&fixture.session,
                                fixture.clock.now_ms + 20) == 0);
  bkvoice_session_snapshot(&fixture.session, &snapshot);
  assert(snapshot.connected && snapshot.ready && snapshot.last_error == 0);

  /* The same connection must accept the next complete capture. */

  test_put_be32(window, BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  session_enqueue_server(&fixture, BKVOICE_COMPANION_WINDOW_UPDATE, 0, 0,
                         window, sizeof(window));
  assert(bkvoice_session_receive_one(&fixture.session, 701) == 0);
  assert(bkvoice_session_ptt_down(&fixture.session,
                                  fixture.clock.now_ms + 30, &second) == 0);
  assert(second.turn_id == first.turn_id + 1);
  session_wait_audio(&fixture);
  assert(bkvoice_session_ptt_up(&fixture.session,
                                fixture.clock.now_ms + 50) == 0);

  assert(bkvoice_session_interrupt(&fixture.session) == 0);
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_uninitialize(&fixture.session) == 0);
  assert(bkvoice_ptt_uninitialize(&fixture.ptt) == 0);
  assert(sem_destroy(&fixture.source.audio_sent) == 0);
  assert(sem_destroy(&fixture.source.wake_reader) == 0);
}

static void test_session_split_reconnect(void)
{
  struct session_fixture_s fixture;
  struct bkvoice_session_snapshot_s before;
  struct bkvoice_session_snapshot_s after;
  struct bkvoice_gateway_frame_s old_frame;
  struct bkvoice_gateway_frame_s old_error;
  struct bkvoice_gateway_frame_s welcome;
  uint8_t window[4];

  session_fixture_initialize(&fixture);
  test_put_be32(window, BKVOICE_COMPANION_AUDIO_FRAME_BYTES);
  session_enqueue_server(&fixture, BKVOICE_COMPANION_WINDOW_UPDATE,
                         0, 0, window, sizeof(window));
  assert(bkvoice_gateway_receive_frame(&fixture.session.gateway,
                                        &old_frame, 700) == 0);
  fixture.transport.empty_recv_error = -ETIMEDOUT;
  assert(bkvoice_gateway_receive_frame(&fixture.session.gateway,
                                        &old_error, 701) == -ETIMEDOUT);
  bkvoice_session_snapshot(&fixture.session, &before);
  assert(before.ready && !before.terminal_pending && !before.gateway.faulted);
  assert(bkvoice_session_interrupt(&fixture.session) == 0);
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_connect(&fixture.session, 800) == 0);
  bkvoice_session_snapshot(&fixture.session, &before);
  fixture.session_id = before.gateway.session_id;
  fixture.server_sequence = 0;
  assert(!before.ready);
  assert(bkvoice_session_dispatch_frame(&fixture.session, &old_frame) ==
         -ESTALE);
  assert(bkvoice_session_dispatch_frame(&fixture.session, &old_error) ==
         -ESTALE);
  bkvoice_session_snapshot(&fixture.session, &after);
  assert(!after.ready && !after.terminal_pending && !after.gateway.faulted);
  assert(after.last_error == before.last_error);

  session_enqueue_server(&fixture, BKVOICE_COMPANION_WELCOME, 0, 0, NULL, 0);
  assert(bkvoice_gateway_receive_frame(&fixture.session.gateway,
                                        &welcome, 801) == 0);
  bkvoice_session_snapshot(&fixture.session, &after);
  assert(!after.ready);
  assert(bkvoice_session_dispatch_frame(&fixture.session, &welcome) == 0);
  assert(bkvoice_session_dispatch_frame(&fixture.session, &old_error) ==
         -ESTALE);
  bkvoice_session_snapshot(&fixture.session, &after);
  assert(after.ready && !after.terminal_pending && !after.gateway.faulted);
  assert(after.last_error == 0 && after.ptt.session_open);
  assert(bkvoice_session_interrupt(&fixture.session) == 0);
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_uninitialize(&fixture.session) == 0);
  assert(bkvoice_ptt_uninitialize(&fixture.ptt) == 0);
  assert(sem_destroy(&fixture.source.audio_sent) == 0);
  assert(sem_destroy(&fixture.source.wake_reader) == 0);
}

static void test_session_timeout_poll(void)
{
  struct session_fixture_s fixture;
  struct bkvoice_turn_token_s token;

  session_fixture_initialize(&fixture);
  assert(bkvoice_session_timeout(&fixture.session, fixture.clock.now_ms) == 0);
  assert(fixture.session.ready && fixture.session.last_error == 0);
  session_start_capture(&fixture, &token);
  assert(bkvoice_session_timeout(&fixture.session,
                                fixture.ptt.turn.deadline_ms - 1) == 0);
  assert(fixture.ptt.turn.state == BKVOICE_TURN_WAITING_TTS);
  assert(bkvoice_session_timeout(&fixture.session,
                                fixture.ptt.turn.deadline_ms) == 0);
  assert(fixture.ptt.last_error == -ETIMEDOUT);
  assert(fixture.ptt.turn.state == BKVOICE_TURN_IDLE);
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_uninitialize(&fixture.session) == 0);
  assert(bkvoice_ptt_uninitialize(&fixture.ptt) == 0);
  assert(sem_destroy(&fixture.source.audio_sent) == 0);
  assert(sem_destroy(&fixture.source.wake_reader) == 0);
}

static void test_session_ota_adapter(void)
{
  struct session_fixture_s fixture;
  struct bkvoice_companion_header_s header;
  const uint8_t *payload;
  uint8_t digest[BKVOICE_COMPANION_OTA_MANIFEST_SHA256_BYTES];
  size_t offset;

