open-vela/contest2026_135_yongwangzhiqian/tests/host/bk7258/test_bk7258_voice_session.c
  memset(digest, 0x7b, sizeof(digest));
  session_fixture_initialize_options(&fixture, true);
  assert(test_get_be32(fixture.transport.tx + BKVOICE_COMPANION_HEADER_BYTES) &
         BKVOICE_COMPANION_CAP_OTA);
  offset = fixture.transport.tx_size;
  session_enqueue_server(&fixture, BKVOICE_COMPANION_OTA_REQUEST, 0, 0,
                         digest, sizeof(digest));
  assert(bkvoice_session_receive_one(&fixture.session, 700) == 0);
  assert(fixture.ota_calls == 1 && fixture.ota_request_sequence ==
         fixture.server_sequence);
  assert(bkvoice_companion_decode(fixture.transport.tx + offset,
                                  fixture.transport.tx_size - offset,
                                  &header, &payload) == 0);
  assert(header.type == BKVOICE_COMPANION_OTA_REPORT &&
         test_get_be32(payload) == fixture.ota_request_sequence);
  assert(bkvoice_gateway_report_ota(&fixture.session.gateway,
                                     fixture.ota_request_sequence, digest,
                                     -EIO, BKVOICE_COMPANION_OTA_FAILED,
                                     0) == 0);
  assert(bkvoice_session_disconnect(&fixture.session, -ENOTCONN) == 0);
  assert(bkvoice_session_uninitialize(&fixture.session) == 0);
  assert(bkvoice_ptt_uninitialize(&fixture.ptt) == 0);
  assert(sem_destroy(&fixture.source.audio_sent) == 0);
  assert(sem_destroy(&fixture.source.wake_reader) == 0);
}

int main(void)
{
  assert(bkvoice_gateway_component_tests() == 0);
  test_session_prefill_order();
  test_session_single_turn_and_remote_cancel();
  test_cancel_cleanup_failure_has_no_ack();
  test_remote_cancel_before_local_release_is_idempotent();
  test_session_split_reconnect();
  test_session_timeout_poll();
  test_session_ota_adapter();
  puts("BKVOICE_SESSION_HOST_PASS");
  return 0;
}
